In [1]:
import pandas as pd
df=pd.read_csv('duplicate_Employee.csv')
df

     name  age location
0  Hasini   23    Delhi
1    janu   31    Delhi
2   dithi   25      Hyd
3  cherry   22     Pune
4   Vijay   31    Delhi
5  cherry   22     Pune
6    amar   27      Hyd
7  vishwa   28      Hyd
8    janu   31    Delhi
9   vinnu   29     Pune

In [2]:
df.nunique()

name        8
age         7
location    3
dtype: int64

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   age       10 non-null     int64
 2   location  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [6]:
df.shape

(10, 3)

In [7]:
df.isnull().sum()

name        0
age         0
location    0
dtype: int64

In [8]:
#duplicate rows
duplicate=df[df.duplicated()]
print("Duplicate rows")
duplicate

Duplicate rows

     name  age location
5  cherry   22     Pune
8    janu   31    Delhi

In [12]:
#column wise duplicate values
duplicate=df[df.duplicated(['location','name'])]
duplicate

     name  age location
5  cherry   22     Pune
8    janu   31    Delhi

In [13]:
#removes duplicates
df.drop_duplicates()

     name  age location
0  Hasini   23    Delhi
1    janu   31    Delhi
2   dithi   25      Hyd
3  cherry   22     Pune
4   Vijay   31    Delhi
6    amar   27      Hyd
7  vishwa   28      Hyd
9   vinnu   29     Pune